const UserCommon = require('../GeneratorBase');

class UserName extends UserCommon {
  constructor() {
    super();
    this.firstnames = [
      "서준", "하준", "도윤", "지호", "예준", "주원", "민준", "지우",
      "유준", "시우", "지후", "준우", "하율", "이준", "서우", "하진",
      "지안", "하람", "아인", "수아", "서연", "하린", "지우", "서윤",
      "지안", "하은", "예린", "유나", "윤서", "지유", "하윤", "예나",
      "채원", "은우", "민서", "시윤", "연우", "소윤", "예원", "지율",
      "지훈", "현우", "준서", "준호", "건우", "승우", "시현", "시온",
      "승현", "준혁", "윤호", "도현", "태윤", "태민", "우진", "하율",
      "은찬", "시후", "우빈", "태양", "하민", "민호", "서진", "규민",
      "시안", "성민", "정우", "민재", "민성", "민규", "지원", "은호",
      "재윤", "한결", "시원", "예성", "주호", "도훈", "윤성", "재민",
      "혁준", "시헌", "현민", "아윤", "라온", "하준", "다온", "유찬",
      "예준", "로운", "민우", "은성", "태현", "주안", "지성", "우주",
      "이안", "지오", "재현"
    ];
  }

  generate() {
    const index = Math.floor(Math.random() * this.firstnames.length);
    return this.firstnames[index];
  }
}

module.exports = UserName;